bekencorp/bk_idk/middleware/soc/bk7236n/hal/sys_hal.c
}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu0_int_mask( clock_state);
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

    uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

	 uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	return REG_READ(clk_div_reg_address);
}

void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	if(core_index == 0)//cpu0
	{
		sys_ll_set_cpu0_int_halt_clk_op_cpu0_speed(value);
	}
}

uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	uint32_t value = 2;

	if(core_index == 0)//cpu0
	{
		value = sys_ll_get_cpu0_int_halt_clk_op_cpu0_speed();
	}

	return value;
}

int32 sys_hal_lp_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v(1);
	sys_ll_set_ana_reg8_vcorelsel(value);
	sys_ll_set_ana_reg8_spi_latch1v(0);

	return 0;
}

uint32_t sys_hal_lp_vol_get()
{
	return sys_ll_get_ana_reg8_vcorelsel();
}

int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v(1);
	// sys_ll_set_ana_reg7_t_vanaldosel(value);
	sys_ll_set_ana_reg8_spi_latch1v(0);
	return 0;
}

uint32_t sys_hal_rf_tx_vol_get()
{
	// return sys_ll_get_ana_reg7_t_vanaldosel();
	return 0;
}

int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v(1);
	// sys_ll_set_ana_reg7_r_vanaldosel(value);
	sys_ll_set_ana_reg8_spi_latch1v(0);
	return 0;
}

uint32_t sys_hal_rf_rx_vol_get()
{
	// return sys_ll_get_ana_reg7_r_vanaldosel();
	return 0;
}

int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}
uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	uint32_t clk_param  = 0;
	if(cksel_core > 1)
	{
		os_printf("set dvfs cksel core > 3 invalid %d\r\n",cksel_core);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX) || (ckdiv_bus > PM_FREQUNCY_DIV_BUS_MAX)||(ckdiv_cpu1 > PM_FREQUNCY_DIV_CPU_MAX)||(ckdiv_cpu0 > PM_FREQUNCY_DIV_CPU_MAX))
	{
		os_printf("set dvfs ckdiv_core ckdiv_bus ckdiv_cpu0_1  ckdiv_cpu0_1  > 1 invalid\r\n");
		return BK_FAIL;
	}

	clk_param = 0;
	clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
	if(((clk_param >> 0x4)&0x1) > cksel_core)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x1 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*3.config cpu clk div*/
		sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus and core clk div*/
		if(ckdiv_core == 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);//avoid the bus freq > 240m
		}

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config cpu clk div*/
		if(ckdiv_core != 0)
		{
			sys_hal_cpu_clk_div_set(0,ckdiv_cpu0);
		}

		/*3.core clk select*/

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x1 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	if(sys_ll_get_ana_reg8_vcorehsel() != vol_value)
	{
		sys_ll_set_ana_reg8_spi_latch1v(1);
		sys_ll_set_ana_reg8_vcorehsel(vol_value);
		sys_ll_set_ana_reg8_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg8_vcorehsel();
}

bk_err_t sys_hal_switch_cpu_bus_freq_high_to_low(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x0,0x0,0x0,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V

			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V

			break;
		case PM_CPU_FRQ_160M://cpu0:160m;cpu1:xm;;cpu2:xm;bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.95V
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
			#if CONFIG_ATE_TEST
			sys_hal_ctrl_vdddig_h_vol(0x7);//0.775V
			#else
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			#endif

			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x5,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V

			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x7,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		case PM_CPU_FRQ_30M://cpu0:30m;cpu1:30m;cpu2:30m;bus:30m
			ret = sys_hal_core_bus_clock_ctrl(0x1,0xF,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		case PM_CPU_FRQ_26M://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			break;
		default:
			break;
	}

	return ret;
}
bk_err_t sys_hal_switch_cpu_bus_freq_low_to_high(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_480M://cpu0:240m;cpu1:480m;cpu2:480m;bus:240m
			sys_hal_ctrl_vdddig_h_vol(0xD);//0.925V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x0,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_240M://cpu0:240m;cpu1:240m;;cpu2:240m;bus:240m
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_160M://cpu0:160m;cpu1:xm;;cpu2:xm;bus:240m
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.95V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;cpu2:120m;bus:120m
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;cpu2:80m;bus:80m
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x5,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;cpu2:60m;bus:60m
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x7,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_30M://cpu0:30m;cpu1:30m;cpu2:30m;bus:30m
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x1,0xF,0x0,0x1,0x1);
			break;
		case PM_CPU_FRQ_26M://cpu0:26m;cpu1:26m;cpu2:26m;bus:26m
			sys_hal_ctrl_vdddig_h_vol(0xB);//0.875V
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			break;
		default:
			break;
	}
	return ret;
}
static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;

