bekencorp/bk_idk/middleware/soc/bk7236n/hal/sys_hal.c
//Yantao Add End

void sys_hal_cali_dpll_spi_trig_disable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ll_set_ana_reg1_osccal_trig(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ll_set_ana_reg1_osccal_trig(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ll_set_ana_reg2_xtalh_ctune(value);
}

__IRAM_SEC void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}
uint32_t sys_hal_analog_get(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}
void sys_hal_set_ana_reg1_value(uint32_t value)
{
    sys_ll_set_ana_reg1_value(value);
}

void sys_hal_set_ana_reg2_value(uint32_t value)
{
    sys_ll_set_ana_reg2_value(value);
}

void sys_hal_set_ana_reg3_value(uint32_t value)
{
    sys_ll_set_ana_reg3_value(value);
}

void sys_hal_set_ana_reg4_value(uint32_t value)
{
    sys_ll_set_ana_reg4_value(value);
}

void sys_hal_set_ana_reg12_value(uint32_t value)
{
    sys_ll_set_ana_reg12_value(value);
}

void sys_hal_set_ana_reg13_value(uint32_t value)
{
    sys_ll_set_ana_reg13_value(value);
}

void sys_hal_set_ana_reg14_value(uint32_t value)
{
    // sys_ll_set_ana_reg14_value(value);
}

void sys_hal_set_ana_reg15_value(uint32_t value)
{
    // sys_ll_set_ana_reg15_value(value);
}

void sys_hal_set_ana_reg16_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg17_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg18_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg19_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg20_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg21_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg27_value(uint32_t value)
{
	// NOT SUPPORT
}

uint32_t sys_hal_bias_reg_read(void)
{
	///TODO
    return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	///TODO

	return 0;

}

uint32_t sys_hal_analog_reg2_get(void)
{
	///TODO

    return 0;
}

uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	///TODO

	return 0;
}

uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	///TODO

	return 0;
}


uint32_t sys_hal_get_xtalh_ctune(void)
{
    return sys_ll_get_ana_reg2_xtalh_ctune();
}

uint32_t sys_hal_cali_bgcalm(void)
{
    uint32_t bandgap;

    sys_ll_set_ana_reg8_spi_latch1v(1);
    sys_ll_set_ana_reg7_pwd_bgcal(0);
    sys_ll_set_ana_reg7_vbgcalmode(0);
    sys_ll_set_ana_reg7_vbgcalstart(0);
    sys_ll_set_ana_reg7_vbgcalstart(1);
    bk_delay_us(100); //100us
    sys_ll_set_ana_reg7_vbgcalstart(0);

    bk_delay_us(2000); //2ms to avoid consistency issue

    bandgap = aon_pmu_ll_get_r7d_bgcal();

    sys_ll_set_ana_reg7_vbgcalmode(1);
    sys_ll_set_ana_reg7_pwd_bgcal(1);
    sys_ll_set_ana_reg8_spi_latch1v(0);

    return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
    return sys_ll_get_ana_reg7_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
    sys_ll_set_ana_reg8_spi_latch1v(1);
    sys_ll_set_ana_reg7_bgcal(value);
    sys_ll_set_ana_reg8_spi_latch1v(0);
}

void sys_hal_set_audioen(uint32_t value)
{
}

void sys_hal_set_dpll_div_cksel(uint32_t value)
{
}

void sys_hal_set_dpll_reset(uint32_t value)
{
}

void sys_hal_set_gadc_ten(uint32_t value)
{
}
/**  WIFI End **/

/**  Audio Start  **/

void sys_hal_aud_select_clock(uint32_t value)
{
}

void sys_hal_aud_clock_en(uint32_t value)
{
}

void sys_hal_aud_mic1_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dacl_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_diffen_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic_rst_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_gain_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dcoc_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_lmdcin_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_adcbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_bias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_idac_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_drv_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_single_en(uint32_t value)
{
}

void sys_hal_aud_mic2_single_en(uint32_t value)
{
}

void sys_hal_aud_int_en(uint32_t value)
{
}

void sys_hal_aud_power_en(uint32_t value)
{
}

void sys_hal_aud_lvcmd_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias1v_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_trim_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audpll_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacr_en(uint32_t value)
{
}

void sys_hal_aud_vdd1v_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_vdd1v5_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_gain_set(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacg_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_aud_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_rvcmd_en(uint32_t value)
{
	//not support
}

void sys_hal_dmic_clk_div_set(uint32_t value)
{
}

void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	//TODO
}

/**  Audio End  **/

/**  FFT Start  **/

void sys_hal_fft_disckg_set(uint32_t value)
{
}

void sys_hal_cpu_fft_int_en(uint32_t value)
{
}

/**  FFT End  **/

/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
}

void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s_cken(value);
}

void sys_hal_i2s1_clock_en(uint32_t value)
{
}

void sys_hal_i2s2_clock_en(uint32_t value)
{
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}

void sys_hal_i2s1_int_en(uint32_t value)
{
}

void sys_hal_i2s2_int_en(uint32_t value)
{
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	//NOT SUPPORT
}

