bekencorp/bk_idk/middleware/soc/bk7236n/hal/sys_hal.c
void sys_hal_apll_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_cb_manu_val_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_cal_val_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_apll_spi_trigger_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_config_set(uint32_t value)
{
	// NOT SUPPORT
}


/**  I2S End  **/


/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
}

void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
}

void sys_hal_set_jpeg_disckg(uint32_t value)
{
}

void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
}

void sys_hal_video_power_en(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
}

void sys_hal_set_jpeg_clk_en(uint32_t value)
{
}

void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
}

/** jpeg end **/

/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
}

/** h264 End **/

/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_swb(enable); //1-1.8v, 0-3.0v
}

void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_xtall(enable);
}

void sys_hal_psram_doc_enable(uint32_t enable)
{
	// NOT SUPPORT
}

void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_en_psramldo(enable);
}

void sys_hal_psram_dpll_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dpll(enable);
}

void sys_hal_psram_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_psram(value);
}

void sys_hal_psram_set_clkdiv(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_psram(value);
}

void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ana_ll_set_ana_reg4_vpsramsel(value);// 1.8V + step 50mv
}

void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// NOT SUPPORT
	// psldo_swb=1, vpsramsel=0 - 1.80v
	// psldo_swb=1, vpsramsel=1 - 1.85v
	// psldo_swb=1, vpsramsel=2 - 1.90v
	// psldo_swb=1, vpsramsel=3 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ana_ll_set_ana_reg4_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ana_ll_set_ana_reg4_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
}

void sys_hal_set_ana_scal_en(uint32_t value)
{
}

void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_hres_sel0v9(uint32_t value)
{
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
}

void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}

void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
}

void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_sel()
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_sdio();
}


void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
}

void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
}

void sys_hal_set_h264_clock_en(uint32_t value)
{
}

void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
    sys_ll_set_ana_reg5_vbias(value);
}

__IRAM_SEC void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	// NOT SUPPORT
}

__IRAM_SEC void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	// NOT SUPPORT
}

#if CONFIG_ANA_RTC || CONFIG_ANA_GPIO
void sys_hal_set_ana_reg8_spi_latch1v(uint32_t value)
{
	sys_ll_set_ana_reg8_spi_latch1v(value);
}

void sys_hal_set_ana_reg5_adc_div(uint32_t value)
{
	// sys_ll_set_ana_reg5_adc_div(value);
}

void sys_hal_set_ana_reg5_pwd_rosc_spi(uint32_t value)
{
	sys_ll_set_ana_reg5_pwd_rosc_spi(value);
}
void sys_hal_set_ana_reg5_rosc_disable(uint32_t value)
{
	sys_ll_set_ana_reg5_rosc_disable(value);
}

void sys_hal_set_ana_reg7_timer_wkrstn(uint32_t value)
{
	sys_ll_set_ana_reg7_timer_wkrstn(value);
}

void sys_hal_set_ana_reg8_rst_wks1v(uint32_t value)
{
	sys_ll_set_ana_reg8_rst_wks1v(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_lvsleep_wkrst(uint32_t value)
{
	sys_ll_set_ana_reg8_lvsleep_wkrst(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_gpiowk_rstn(uint32_t value)
{
	sys_ll_set_ana_reg8_gpiowk_rstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rtcwk_rstn(uint32_t value)
{
	sys_ll_set_ana_reg8_rtcwk_rstn(value);
}
void sys_hal_set_ana_reg8_ensfsdd(uint32_t value)
{
	sys_ll_set_ana_reg8_ensfsdd(value);
}

void sys_hal_set_ana_reg8_vlden(uint32_t value)
{
	sys_ll_set_ana_reg8_vlden(value);
}

void sys_hal_set_ana_reg8_pwdovp1v(uint32_t value)
{
	// sys_ll_set_ana_reg8_pwdovp1v(value);
}
void sys_hal_set_ana_reg9_spi_timerwken(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_timerwken(value);
}

void sys_hal_set_ana_reg9_spi_byp32pwd(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_byp32pwd(value);
}

uint32_t sys_hal_get_ana_reg11_gpiowk(void)
{
	return sys_ll_get_ana_reg11_gpiowk();
}

void sys_hal_set_ana_reg11_gpiowk(uint32_t value)
{
	sys_ll_set_ana_reg11_gpiowk(value);
}

uint32_t sys_hal_get_ana_reg11_rtcsel(void)
{
	return sys_ll_get_ana_reg11_rtcsel();
}

void sys_hal_set_ana_reg11_rtcsel(uint32_t value)
{
	sys_ll_set_ana_reg11_rtcsel(value);
}

uint32_t sys_hal_get_ana_reg11_timersel(void)
{
	return sys_ll_get_ana_reg11_timersel();
}

