bekencorp/bk_idk/middleware/soc/bk7236n/hal/sys_hal.c
void sys_hal_set_ana_reg11_timersel(uint32_t value)
{
	sys_ll_set_ana_reg11_timersel(value);
}

uint32_t sys_hal_get_ana_reg12_timersel(void)
{
	return sys_ll_get_ana_reg12_timersel();
}

void sys_hal_set_ana_reg12_timersel(uint32_t value)
{
	sys_ll_set_ana_reg12_timersel(value);
}

uint32_t sys_hal_get_ana_reg13_rtcsel(void)
{
	return sys_ll_get_ana_reg13_rtcsel();
}

void sys_hal_set_ana_reg13_rtcsel(uint32_t value)
{
	sys_ll_set_ana_reg13_rtcsel(value);
}
#endif

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

void sys_hal_adjust_dpll(void)
{
    uint32_t unlock, unlockL = 0, unlockH = 0;
    int32_t dpll_band, count;

    unlock = aon_pmu_hal_get_dpll_unlock(&unlockL, &unlockH);
    if (!unlock) {
        return;
    }
    dpll_band = (int32_t)sys_ll_get_ana_reg1_bandmanual();
    for (count = 7; count > 0; count--) {
        if (unlockL) {
            dpll_band++;
        } else {
            dpll_band--;
        }
        if (dpll_band < 0) {
            break;
        } else if (dpll_band > 0x7F) {
            break;
        }
        sys_ll_set_ana_reg1_bandmanual(dpll_band);
    }
}

uint32_t sys_hal_cali_dpll(uint32_t first_time)
{
    uint32_t int_mask = sys_hal_int_group2_disable(DPLL_UNLOCK_INTERRUPT_CTRL_BIT);

    //liupeng20250519: disable unlock detecter and delay 20us when cali dpll
    sys_ll_set_ana_reg0_cben(1);
    sys_ll_set_ana_reg1_manual(0);
    sys_hal_delay(340);

    sys_hal_cali_dpll_spi_detect_disable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    //ronghui20250604: toggle twice to avoid wrong value after 0x40<29:28>=1
    sys_hal_cali_dpll_spi_detect_disable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    sys_ll_set_ana_reg1_bandmanual(aon_pmu_hal_get_dpll_band());
    sys_ll_set_ana_reg1_manual(1);
    sys_ll_set_ana_reg0_cben(0);

    if (int_mask & DPLL_UNLOCK_INTERRUPT_CTRL_BIT) {
        sys_hal_int_group2_enable(DPLL_UNLOCK_INTERRUPT_CTRL_BIT);
    }

    return BK_OK;
}
static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	uint32_t coresel = 0;
	uint32_t corediv = 0;
	//zhangheng20231018: calibrate dpll before use
	/*0x2:320M, 0X3:480M*/
	coresel = sys_ll_get_cpu_clk_div_mode1_cksel_core();
	corediv = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();
	if((coresel != PM_CLKSEL_CORE_480M) || !sys_ll_get_ana_reg1_manual())
	{
		sys_hal_cali_dpll(1);
	}

	/*default of MP flash 80M = 80/1*/
	if(sys_ll_get_cpu_clk_div_mode2_cksel_flash() != PM_CLKSEL_FLASH_80M)
	{
		if(sys_ll_get_cpu_clk_div_mode2_ckdiv_flash() != 0x0)// 80/1
		{
			sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(0x0);
		}
		sys_hal_flash_set_clk(PM_CLKSEL_FLASH_80M);
	}

	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	if((coresel != PM_CLKSEL_CORE_480M) && (corediv != 0x3))//160M
	{
		sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
		sys_hal_delay(10000);

		sys_hal_mclk_mux_set(PM_CLKSEL_CORE_480M);/*clock source: DPLL, 480M*/
	}
	timer_hal_us_init();

	/*increase the anaspi_freq, current it only use for lpo: external 32k, 26m/32k*/
	//if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		sys_ll_set_cpu_anaspi_freq_anaspi_freq(0x2);//ana_sck = bus_clk/((divd+1)*2))
	}
}
static void sys_hal_pwd_rosc()
{
	volatile uint32_t count = PM_POWER_ON_ROSC_STABILITY_TIME;
	/*when the lpo src select external 32k or 26m/32k, it disable the rosc;because make sure write the analog register successfully*/
	if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		if(aon_pmu_ll_get_r41_lpo_config() == PM_LPO_SRC_ROSC)
		{
			aon_pmu_ll_set_r41_lpo_config(PM_LPO_SRC_DIVD);
		}

		if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x1)
		{
			sys_ll_set_ana_reg5_pwd_rosc_spi(0x1);
		}
	}
	else
	{
		if(sys_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
		{
			sys_ll_set_ana_reg5_pwd_rosc_spi(0x0);

			while(count--)//delay time for stability when power on rosc
			{
			}
		}
	}
}

//TODO the module owner can put the sys init to better place
void sys_hal_early_init(void)
{
	/*power down rosc, temp modify*/
	sys_hal_pwd_rosc();

	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	// power up dpll first
	val |= (0x1 << 5);
	sys_hal_analog_set(ANALOG_REG5,val);

	sys_hal_analog_set(ANALOG_REG0, 0x19219780);//liupeng202400807:<9:7>=7;zhiyin20250429<11>=0 enable dpll_unlock flag;zhiyin20250604<29:28>=1
	sys_hal_analog_set(ANALOG_REG1, 0xC02EFA00);
	sys_hal_analog_set(ANALOG_REG2, 0x0600D436);
	sys_hal_analog_set(ANALOG_REG3, 0xFDFC0BC8);//tenglong20240806:high psrr as default, low when sleep;ronghui20250520<27>=1 avoid dpll unlock detect issue when high temp
	sys_hal_analog_set(ANALOG_REG4, 0x40000000);
	sys_hal_analog_set(ANALOG_REG5, 0x84072160);
	sys_hal_analog_set(ANALOG_REG6, 0x80088100);//liupeng20250427
	sys_hal_analog_set(ANALOG_REG7, 0x57E697C6);//tenglong20250430:ldo current limit for EVM;//shuguang20250512:vio=3.3V;xinyuan20250611:<9:6>=F for better EVM
	sys_hal_analog_set(ANALOG_REG8, 0xF97C72E4);//tenglong20250519:<31:30>=3(0.9V), same with BK7236_SYS_ANA_4D<13:12>

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ll_set_ana_reg8_spi_latch1v(1);
	sys_hal_analog_set(ANALOG_REG9, 0xB7553327);//tenglong20240805:2M buck for EVM
	sys_hal_analog_set(ANALOG_REG10, 0xF7EEB89A);
	sys_hal_analog_set(ANALOG_REG11, 0x00000000);
	sys_hal_analog_set(ANALOG_REG12, 0x00100000);
	sys_hal_analog_set(ANALOG_REG13, 0x00080000);
	sys_hal_analog_set(ANALOG_REG14, 0x00A80008);
	sys_hal_analog_set(ANALOG_REG15, 0x528809F6);
	sys_ll_set_ana_reg8_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);

	//TODO: should be done with wifi_init->bk_pm_clock_ctrl
	sys_hal_clk_pwr_ctrl(CLK_PWR_ID_RF, CLK_PWR_CTRL_PWR_UP);
}

void sys_hal_set_scr_clk(uint32_t value)
{
}

/**  SCR End  */
